tutorials/test/crossWLF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     openInjMoldSim;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.005;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.01;

maxDeltaT       1;
maxAlphaCo      1;

functions {

    forces
    {
        type        forces;
        functionObjectLibs ("libmojforces01.so");
        log         yes;
        patches     (wallOut);

        //rhoName rhoInf;
        rhoInf 1;
        origin (0 0 0);
        /*coordinateSystem
        {
            origin  (0 0 0);
            e3      (0 0 1);
            e1      (1 0 0);
        }*/
        coordinateRotation
        {
            type        axesRotation;
            e1          (1 0 0);
            e2          (0 1 0);
        }
    }
}

// ************************************************************************* //
