tutorials/test/crossWLF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFH Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshHict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

a 1;
b 10;
c 0.1;
na 6;
nb 40;
nc 1;

/* H #calc "0.1*$R1";*/

convertToMeters 1e-3;

vertices
(
    // Upper right quadrant
    (0   0  0)
    ($a  0  0)
    ($a  $b 0)
    (0   $b 0)

    (0   0  $c)
    ($a  0  $c)
    ($a  $b $c)
    (0   $b $c)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($na $nb $nc) simpleGrading (1 1 1)
);


boundary
(
    wallIn
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    wallOut
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    wallDown
    {
        type cyclic;
        neighbourPatch wallUp;

        faces
        (
            (0 1 5 4)
        );
    }

    wallUp
    {
        type cyclic;
        neighbourPatch wallDown;

        faces
        (
            (7 6 2 3)
        );
    }



    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
