tutorials/test/crossWLF/constant/thermophysicalProperties.poly
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            mojHeRhoThermo;
    mixture         pureMixture;
    transport       crossWLF;
    thermo          hPolynomial;
    equationOfState polymerPVT;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   18.0;
    }
    equationOfState
    {
        b1m         9.76e-4;
        b2m         5.8e-7;
        b3m         1.67e8;
        b4m         3.6e-3;
        b1s         9.76e-4;
        b2s         2.3e-7;
        b3s         2.6e8;
        b4s         3.0e-3;
        b5          373.0;
        b6          5.1e-7;
        b7          0.0;
        b8          0.0;
        b9          0.0;
    }
    thermodynamics
    {
        Hf              0;
        Sf              0;
        CpCoeffs<8>     (-3.01067e6  53099.2  -395.962  1.61913  -0.00392213  5.63118e-6  -4.43963e-9 1.48364e-12);//J/(kgK)
    }
    transport //PS Styron 678E - Vietri 2011
    {
            n          0.252;//1
        Tau        30800.0;//Pa
        D1         4.76e10;//Pa s
        D2         373.15;//K
        A1         25.7;//1
        A2         61.06;//K
    	lambda     0.22;//W/(mK) toplotna prevodnost PS - glej Dawson pressure, temperature dependence
        etaMin     5;//Pas
        etaMax     1e8;//Pas
        TnoFlow    373.15;//K
    }
}


// ************************************************************************* //
