tutorials/test/crossWLF/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
//OpenFOAM-3.0.1/tutorials/lagrangian/reactingParcelFoam/parcelInBox/system/
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          probesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Fields to be probed. runTime modifiable!
fields
(
    T p rho
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (5.859375e-3 0.236486e-3 0.546875e-3)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
